package com.luhuanju.listenread.entity

/*
 * Copyright (C) 2016，上海宅米贸易有限公司
 *
 * Author: huanjulu on 16/8/30 
 */

import com.google.gson.annotations.Expose
import com.google.gson.annotations.SerializedName

class TransceiverDetailWrap {


    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"content":"曲目：【暖地电台】嗨，你在寻找什么发行：邻居的耳朵有声电台最近有人在后台问我关于工作和生活的苦恼，生活中也有朋友在面临这样的苦恼，再加上最近看星姐的文章也受到一些感触，所以就写下这篇文章，说一下自己的感悟。我不能说我说的就是正确的，毕竟每个人都有每个人的想法。但是我希望，它能给正处在迷茫或者谷底的你们一些不同的看待问题的视角。如果你觉得你现在站在谷底，如果你现在正在迷茫，那么把心沉淀下来，好好想想你以后的路，勇敢的走出去，那么，你以后有的每一步，都是在走上坡路，都是在迈向成功。这几年网红正盛，各种励志、鸡汤，所有的书都告诉你不畏将来，想做什么就去做吧，不要让未来为你的懦弱买单。是的，这些励志的人，新一代的网红，他们是很努力，可是每一个人都有每一个人的生活方式，别人的不一定是适合你的。他们可以为自己的梦想买单，去做一般人不敢去做的事情，但那些人毕竟是少数人，在这个社会里，能做自己喜欢的工作的人不是特别多。但是他们为什么还会在这个行业做下去，一来是因为他的专业太局限，除了这份职业，他不会再做什么，也就是我们所谓的专业技术人员。试想一下，你让一个搞IT 的人去做一份营销报告，你让他怎么做。二来是因为他们需要这份工作带给他的一些其它利益。虽然不喜欢，但是稳定，安逸，可以有很多的时间去支配到其它的地方。三来我想应该也是最重要的一点，在这个世界里，行业千千万，有些事总是要有人去做的。这样的人真的很多，你要说世界那么大，他们不想去看看嘛。我想，那真的是扯淡。没有人不想不劳而获，但是没有人能不劳而获。所以看看眼前，问问自己，你到底想要什么。人生在世，不是每一件事情都称心如意的。那些追求梦想的人，没有一个人不是碰的头破血流之后才有的成就。周末的时候，我在家看跨界歌王，王子文作为替补歌手，当她唱完的时候，评委问她，听说当时还去韩国当过练习生。她说是的，那段日子真的是特别刻骨铭心。每天6点起床，晚上12点1点才能休息。不停的在训练，每天还吃不饱。试想一下，这样的苦你吃的了嘛。天上真的不会掉馅饼，如果你没有非人的勇气和坚持，那么就在自己的岗位上继续做下去吧。努力把不喜欢的工作变成喜欢的工作才是正道。在我刚进公司的时候，当时开动员大会，一个领导讲了这么一句话。她说：干一行爱一行，如果你现在不喜欢它，那么就想办法去爱上它。那样你会在其中找到更大的乐趣。她说完这句话到现在已经六年了，而我现在还记得。甚至还会记得很久。如今的我还是不怎么喜欢这份工作，但是我很清楚我不能改变它，那么我就去适应它，多想想这份工作给你带来的益处，而不是永远沉浸在自己的想法里。又或者像星姐说的，其实大部分人不是不喜欢自己的本职工作，而是逃避压力和束缚，总觉得生活在别处。但其实任何事情，包括爱好，只要变成工作，都有压力和束缚，没有舒舒服服赚大钱的事儿。如果你一直告诉自己我不喜欢这份工作，又无力挣脱，想法太多，实践太少，那样的话，你会一直陷入到一个死循环，一直颓废下去。在上一期节目里，我们讲了一个爱情故事，但导致爱情失败的原因正是因为工作的失利。如果你像上一期的男主一样，因为一点挫折，就开始一蹶不振，不管是多么死心塌地爱着你的人也是会倦的。在这个飞速发展的社会里，没有人要为谁守身一辈子。我们需要正能量，需要一个可以和我们一起携手走向更好生活的人。无论你现在身处什么地方，只要你愿意继续努力，没有任何人嘲笑你的努力。所有吃过的苦，受过的嘲笑，最终都会以一记狠狠的耳光抽到他们的脸上。不管是自己喜欢的工作，还是想要逃避。这终究都不是解决问题的根本办法。我们总说，我不喜欢这份工作，可是你都干了这么久了，对待工作就像感情一样，两个人相处还会日久生情，对待工作你就怎么一点都不能担待呢。或许有人会说，这份工作对我已经没有挑战性了，那你就去往上走啊，天外有天，人外有人这句话，不是空想，而是真的存在。每一个行业都有等级之分，等你在你的行业做到最顶级再来告诉我，没有挑战性。这个时候，你换工作，换职业，我会两个大拇指送给你。在这之前，我想请你好好想想，你到底是因为什么原因而不喜欢这份工作。歌曲：曲婉婷\u2014\u2014阳光下的我们【暖地电台】嗨，你在寻找什么邻居的耳朵有声电台征稿ing，投稿者请将音频发送至linjudeerduo@126.com 详情请见邻居的耳朵有声电台征稿要求本文章版权属于文章作者所有，转载请与作者联系并注明出处：【暖地电台】嗨，你在寻找什么","time":"2016-08-30","title":"【暖地电台】嗨，你在寻找什么","ret_code":0,"img_list":[{"height":298,"width":300,"url":"http://ear.duomi.com/wp-content/uploads/2016/08/129060475+-300x298.jpg"}],"all_list":[{"height":298,"width":300,"url":"http://ear.duomi.com/wp-content/uploads/2016/08/129060475+-300x298.jpg"},"曲目：【暖地电台】嗨，你在寻找什么","发行：邻居的耳朵有声电台","最近有人在后台问我关于工作和生活的苦恼，生活中也有朋友在面临这样的苦恼，再加上最近看星姐的文章也受到一些感触，所以就写下这篇文章，说一下自己的感悟。我不能说我说的就是正确的，毕竟每个人都有每个人的想法。但是我希望，它能给正处在迷茫或者谷底的你们一些不同的看待问题的视角。如果你觉得你现在站在谷底，如果你现在正在迷茫，那么把心沉淀下来，好好想想你以后的路，勇敢的走出去，那么，你以后有的每一步，都是在走上坡路，都是在迈向成功。","这几年网红正盛，各种励志、鸡汤，所有的书都告诉你不畏将来，想做什么就去做吧，不要让未来为你的懦弱买单。是的，这些励志的人，新一代的网红，他们是很努力，可是每一个人都有每一个人的生活方式，别人的不一定是适合你的。他们可以为自己的梦想买单，去做一般人不敢去做的事情，但那些人毕竟是少数人，在这个社会里，能做自己喜欢的工作的人不是特别多。但是他们为什么还会在这个行业做下去，一来是因为他的专业太局限，除了这份职业，他不会再做什么，也就是我们所谓的专业技术人员。试想一下，你让一个搞IT 的人去做一份营销报告，你让他怎么做。二来是因为他们需要这份工作带给他的一些其它利益。虽然不喜欢，但是稳定，安逸，可以有很多的时间去支配到其它的地方。三来我想应该也是最重要的一点，在这个世界里，行业千千万，有些事总是要有人去做的。","这样的人真的很多，你要说世界那么大，他们不想去看看嘛。我想，那真的是扯淡。没有人不想不劳而获，但是没有人能不劳而获。所以看看眼前，问问自己，你到底想要什么。人生在世，不是每一件事情都称心如意的。那些追求梦想的人，没有一个人不是碰的头破血流之后才有的成就。周末的时候，我在家看跨界歌王，王子文作为替补歌手，当她唱完的时候，评委问她，听说当时还去韩国当过练习生。她说是的，那段日子真的是特别刻骨铭心。每天6点起床，晚上12点1点才能休息。不停的在训练，每天还吃不饱。试想一下，这样的苦你吃的了嘛。天上真的不会掉馅饼，如果你没有非人的勇气和坚持，那么就在自己的岗位上继续做下去吧。努力把不喜欢的工作变成喜欢的工作才是正道。","在我刚进公司的时候，当时开动员大会，一个领导讲了这么一句话。她说：干一行爱一行，如果你现在不喜欢它，那么就想办法去爱上它。那样你会在其中找到更大的乐趣。她说完这句话到现在已经六年了，而我现在还记得。甚至还会记得很久。如今的我还是不怎么喜欢这份工作，但是我很清楚我不能改变它，那么我就去适应它，多想想这份工作给你带来的益处，而不是永远沉浸在自己的想法里。","又或者像星姐说的，其实大部分人不是不喜欢自己的本职工作，而是逃避压力和束缚，总觉得生活在别处。但其实任何事情，包括爱好，只要变成工作，都有压力和束缚，没有舒舒服服赚大钱的事儿。","如果你一直告诉自己我不喜欢这份工作，又无力挣脱，想法太多，实践太少，那样的话，你会一直陷入到一个死循环，一直颓废下去。","在上一期节目里，我们讲了一个爱情故事，但导致爱情失败的原因正是因为工作的失利。如果你像上一期的男主一样，因为一点挫折，就开始一蹶不振，不管是多么死心塌地爱着你的人也是会倦的。在这个飞速发展的社会里，没有人要为谁守身一辈子。我们需要正能量，需要一个可以和我们一起携手走向更好生活的人。无论你现在身处什么地方，只要你愿意继续努力，没有任何人嘲笑你的努力。所有吃过的苦，受过的嘲笑，最终都会以一记狠狠的耳光抽到他们的脸上。","不管是自己喜欢的工作，还是想要逃避。这终究都不是解决问题的根本办法。我们总说，我不喜欢这份工作，可是你都干了这么久了，对待工作就像感情一样，两个人相处还会日久生情，对待工作你就怎么一点都不能担待呢。或许有人会说，这份工作对我已经没有挑战性了，那你就去往上走啊，天外有天，人外有人这句话，不是空想，而是真的存在。每一个行业都有等级之分，等你在你的行业做到最顶级再来告诉我，没有挑战性。这个时候，你换工作，换职业，我会两个大拇指送给你。在这之前，我想请你好好想想，你到底是因为什么原因而不喜欢这份工作。","歌曲：曲婉婷\u2014\u2014阳光下的我们","【暖地电台】嗨，你在寻找什么","邻居的耳朵有声电台征稿ing，投稿者请将音频发送至linjudeerduo@126.com 详情请见","邻居的耳朵有声电台征稿要求","本文章版权属于文章作者所有，转载请与作者联系并注明出处：","【暖地电台】嗨，你在寻找什么"],"html":"
     *
     *曲目：【暖地电台】嗨，你在寻找什么<\/p>
     *
     *发行：邻居的耳朵有声电台<\/p>
     *
     *最近有人在后台问我关于工作和生活的苦恼，生活中也有朋友在面临这样的苦恼，再加上最近看星姐的文章也受到一些感触，所以就写下这篇文章，说一下自己的感悟。我不能说我说的就是正确的，毕竟每个人都有每个人的想法。但是我希望，它能给正处在迷茫或者谷底的你们一些不同的看待问题的视角。如果你觉得你现在站在谷底，如果你现在正在迷茫，那么把心沉淀下来，好好想想你以后的路，勇敢的走出去，那么，你以后有的每一步，都是在走上坡路，都是在迈向成功。<\/p>
     *
     *这几年网红正盛，各种励志、鸡汤，所有的书都告诉你不畏将来，想做什么就去做吧，不要让未来为你的懦弱买单。是的，这些励志的人，新一代的网红，他们是很努力，可是每一个人都有每一个人的生活方式，别人的不一定是适合你的。他们可以为自己的梦想买单，去做一般人不敢去做的事情，但那些人毕竟是少数人，在这个社会里，能做自己喜欢的工作的人不是特别多。但是他们为什么还会在这个行业做下去，一来是因为他的专业太局限，除了这份职业，他不会再做什么，也就是我们所谓的专业技术人员。试想一下，你让一个搞IT 的人去做一份营销报告，你让他怎么做。二来是因为他们需要这份工作带给他的一些其它利益。虽然不喜欢，但是稳定，安逸，可以有很多的时间去支配到其它的地方。三来我想应该也是最重要的一点，在这个世界里，行业千千万，有些事总是要有人去做的。<\/p>
     *
     *这样的人真的很多，你要说世界那么大，他们不想去看看嘛。我想，那真的是扯淡。没有人不想不劳而获，但是没有人能不劳而获。所以看看眼前，问问自己，你到底想要什么。人生在世，不是每一件事情都称心如意的。那些追求梦想的人，没有一个人不是碰的头破血流之后才有的成就。周末的时候，我在家看跨界歌王，王子文作为替补歌手，当她唱完的时候，评委问她，听说当时还去韩国当过练习生。她说是的，那段日子真的是特别刻骨铭心。每天6点起床，晚上12点1点才能休息。不停的在训练，每天还吃不饱。试想一下，这样的苦你吃的了嘛。天上真的不会掉馅饼，如果你没有非人的勇气和坚持，那么就在自己的岗位上继续做下去吧。努力把不喜欢的工作变成喜欢的工作才是正道。<\/p>
     *
     *在我刚进公司的时候，当时开动员大会，一个领导讲了这么一句话。她说：干一行爱一行，如果你现在不喜欢它，那么就想办法去爱上它。那样你会在其中找到更大的乐趣。她说完这句话到现在已经六年了，而我现在还记得。甚至还会记得很久。如今的我还是不怎么喜欢这份工作，但是我很清楚我不能改变它，那么我就去适应它，多想想这份工作给你带来的益处，而不是永远沉浸在自己的想法里。<\/p>
     *
     *又或者像星姐说的，其实大部分人不是不喜欢自己的本职工作，而是逃避压力和束缚，总觉得生活在别处。但其实任何事情，包括爱好，只要变成工作，都有压力和束缚，没有舒舒服服赚大钱的事儿。<\/p>
     *
     *如果你一直告诉自己我不喜欢这份工作，又无力挣脱，想法太多，实践太少，那样的话，你会一直陷入到一个死循环，一直颓废下去。<\/p>
     *
     *在上一期节目里，我们讲了一个爱情故事，但导致爱情失败的原因正是因为工作的失利。如果你像上一期的男主一样，因为一点挫折，就开始一蹶不振，不管是多么死心塌地爱着你的人也是会倦的。在这个飞速发展的社会里，没有人要为谁守身一辈子。我们需要正能量，需要一个可以和我们一起携手走向更好生活的人。无论你现在身处什么地方，只要你愿意继续努力，没有任何人嘲笑你的努力。所有吃过的苦，受过的嘲笑，最终都会以一记狠狠的耳光抽到他们的脸上。<\/p>
     *
     *不管是自己喜欢的工作，还是想要逃避。这终究都不是解决问题的根本办法。我们总说，我不喜欢这份工作，可是你都干了这么久了，对待工作就像感情一样，两个人相处还会日久生情，对待工作你就怎么一点都不能担待呢。或许有人会说，这份工作对我已经没有挑战性了，那你就去往上走啊，天外有天，人外有人这句话，不是空想，而是真的存在。每一个行业都有等级之分，等你在你的行业做到最顶级再来告诉我，没有挑战性。这个时候，你换工作，换职业，我会两个大拇指送给你。在这之前，我想请你好好想想，你到底是因为什么原因而不喜欢这份工作。<\/p>
     *
     *歌曲：曲婉婷\u2014\u2014阳光下的我们<\/p>
     *
     *【暖地电台】嗨，你在寻找什么<\/p>
     *
     *邻居的耳朵有声电台征稿ing，投稿者请将音频发送至linjudeerduo@126.com 详情请见<\/p>
     *
     *邻居的耳朵有声电台征稿要求<\/p>
     *
     *本文章版权属于文章作者所有，转载请与作者联系并注明出处：<\/p>
     *
     *【暖地电台】嗨，你在寻找什么<\/p>"}
     */
    @SerializedName("showapi_res_code")
    @Expose
    var showapi_res_code: Int = 0
    @SerializedName("showapi_res_error")
    @Expose
    var showapi_res_error: String? = null
    /**
     * content : 曲目：【暖地电台】嗨，你在寻找什么发行：邻居的耳朵有声电台最近有人在后台问我关于工作和生活的苦恼，生活中也有朋友在面临这样的苦恼，再加上最近看星姐的文章也受到一些感触，所以就写下这篇文章，说一下自己的感悟。我不能说我说的就是正确的，毕竟每个人都有每个人的想法。但是我希望，它能给正处在迷茫或者谷底的你们一些不同的看待问题的视角。如果你觉得你现在站在谷底，如果你现在正在迷茫，那么把心沉淀下来，好好想想你以后的路，勇敢的走出去，那么，你以后有的每一步，都是在走上坡路，都是在迈向成功。这几年网红正盛，各种励志、鸡汤，所有的书都告诉你不畏将来，想做什么就去做吧，不要让未来为你的懦弱买单。是的，这些励志的人，新一代的网红，他们是很努力，可是每一个人都有每一个人的生活方式，别人的不一定是适合你的。他们可以为自己的梦想买单，去做一般人不敢去做的事情，但那些人毕竟是少数人，在这个社会里，能做自己喜欢的工作的人不是特别多。但是他们为什么还会在这个行业做下去，一来是因为他的专业太局限，除了这份职业，他不会再做什么，也就是我们所谓的专业技术人员。试想一下，你让一个搞IT 的人去做一份营销报告，你让他怎么做。二来是因为他们需要这份工作带给他的一些其它利益。虽然不喜欢，但是稳定，安逸，可以有很多的时间去支配到其它的地方。三来我想应该也是最重要的一点，在这个世界里，行业千千万，有些事总是要有人去做的。这样的人真的很多，你要说世界那么大，他们不想去看看嘛。我想，那真的是扯淡。没有人不想不劳而获，但是没有人能不劳而获。所以看看眼前，问问自己，你到底想要什么。人生在世，不是每一件事情都称心如意的。那些追求梦想的人，没有一个人不是碰的头破血流之后才有的成就。周末的时候，我在家看跨界歌王，王子文作为替补歌手，当她唱完的时候，评委问她，听说当时还去韩国当过练习生。她说是的，那段日子真的是特别刻骨铭心。每天6点起床，晚上12点1点才能休息。不停的在训练，每天还吃不饱。试想一下，这样的苦你吃的了嘛。天上真的不会掉馅饼，如果你没有非人的勇气和坚持，那么就在自己的岗位上继续做下去吧。努力把不喜欢的工作变成喜欢的工作才是正道。在我刚进公司的时候，当时开动员大会，一个领导讲了这么一句话。她说：干一行爱一行，如果你现在不喜欢它，那么就想办法去爱上它。那样你会在其中找到更大的乐趣。她说完这句话到现在已经六年了，而我现在还记得。甚至还会记得很久。如今的我还是不怎么喜欢这份工作，但是我很清楚我不能改变它，那么我就去适应它，多想想这份工作给你带来的益处，而不是永远沉浸在自己的想法里。又或者像星姐说的，其实大部分人不是不喜欢自己的本职工作，而是逃避压力和束缚，总觉得生活在别处。但其实任何事情，包括爱好，只要变成工作，都有压力和束缚，没有舒舒服服赚大钱的事儿。如果你一直告诉自己我不喜欢这份工作，又无力挣脱，想法太多，实践太少，那样的话，你会一直陷入到一个死循环，一直颓废下去。在上一期节目里，我们讲了一个爱情故事，但导致爱情失败的原因正是因为工作的失利。如果你像上一期的男主一样，因为一点挫折，就开始一蹶不振，不管是多么死心塌地爱着你的人也是会倦的。在这个飞速发展的社会里，没有人要为谁守身一辈子。我们需要正能量，需要一个可以和我们一起携手走向更好生活的人。无论你现在身处什么地方，只要你愿意继续努力，没有任何人嘲笑你的努力。所有吃过的苦，受过的嘲笑，最终都会以一记狠狠的耳光抽到他们的脸上。不管是自己喜欢的工作，还是想要逃避。这终究都不是解决问题的根本办法。我们总说，我不喜欢这份工作，可是你都干了这么久了，对待工作就像感情一样，两个人相处还会日久生情，对待工作你就怎么一点都不能担待呢。或许有人会说，这份工作对我已经没有挑战性了，那你就去往上走啊，天外有天，人外有人这句话，不是空想，而是真的存在。每一个行业都有等级之分，等你在你的行业做到最顶级再来告诉我，没有挑战性。这个时候，你换工作，换职业，我会两个大拇指送给你。在这之前，我想请你好好想想，你到底是因为什么原因而不喜欢这份工作。歌曲：曲婉婷——阳光下的我们【暖地电台】嗨，你在寻找什么邻居的耳朵有声电台征稿ing，投稿者请将音频发送至linjudeerduo@126.com 详情请见邻居的耳朵有声电台征稿要求本文章版权属于文章作者所有，转载请与作者联系并注明出处：【暖地电台】嗨，你在寻找什么
     * time : 2016-08-30
     * title : 【暖地电台】嗨，你在寻找什么
     * ret_code : 0
     * img_list : [{"height":298,"width":300,"url":"http://ear.duomi.com/wp-content/uploads/2016/08/129060475+-300x298.jpg"}]
     * all_list : [{"height":298,"width":300,"url":"http://ear.duomi.com/wp-content/uploads/2016/08/129060475+-300x298.jpg"},"曲目：【暖地电台】嗨，你在寻找什么","发行：邻居的耳朵有声电台","最近有人在后台问我关于工作和生活的苦恼，生活中也有朋友在面临这样的苦恼，再加上最近看星姐的文章也受到一些感触，所以就写下这篇文章，说一下自己的感悟。我不能说我说的就是正确的，毕竟每个人都有每个人的想法。但是我希望，它能给正处在迷茫或者谷底的你们一些不同的看待问题的视角。如果你觉得你现在站在谷底，如果你现在正在迷茫，那么把心沉淀下来，好好想想你以后的路，勇敢的走出去，那么，你以后有的每一步，都是在走上坡路，都是在迈向成功。","这几年网红正盛，各种励志、鸡汤，所有的书都告诉你不畏将来，想做什么就去做吧，不要让未来为你的懦弱买单。是的，这些励志的人，新一代的网红，他们是很努力，可是每一个人都有每一个人的生活方式，别人的不一定是适合你的。他们可以为自己的梦想买单，去做一般人不敢去做的事情，但那些人毕竟是少数人，在这个社会里，能做自己喜欢的工作的人不是特别多。但是他们为什么还会在这个行业做下去，一来是因为他的专业太局限，除了这份职业，他不会再做什么，也就是我们所谓的专业技术人员。试想一下，你让一个搞IT 的人去做一份营销报告，你让他怎么做。二来是因为他们需要这份工作带给他的一些其它利益。虽然不喜欢，但是稳定，安逸，可以有很多的时间去支配到其它的地方。三来我想应该也是最重要的一点，在这个世界里，行业千千万，有些事总是要有人去做的。","这样的人真的很多，你要说世界那么大，他们不想去看看嘛。我想，那真的是扯淡。没有人不想不劳而获，但是没有人能不劳而获。所以看看眼前，问问自己，你到底想要什么。人生在世，不是每一件事情都称心如意的。那些追求梦想的人，没有一个人不是碰的头破血流之后才有的成就。周末的时候，我在家看跨界歌王，王子文作为替补歌手，当她唱完的时候，评委问她，听说当时还去韩国当过练习生。她说是的，那段日子真的是特别刻骨铭心。每天6点起床，晚上12点1点才能休息。不停的在训练，每天还吃不饱。试想一下，这样的苦你吃的了嘛。天上真的不会掉馅饼，如果你没有非人的勇气和坚持，那么就在自己的岗位上继续做下去吧。努力把不喜欢的工作变成喜欢的工作才是正道。","在我刚进公司的时候，当时开动员大会，一个领导讲了这么一句话。她说：干一行爱一行，如果你现在不喜欢它，那么就想办法去爱上它。那样你会在其中找到更大的乐趣。她说完这句话到现在已经六年了，而我现在还记得。甚至还会记得很久。如今的我还是不怎么喜欢这份工作，但是我很清楚我不能改变它，那么我就去适应它，多想想这份工作给你带来的益处，而不是永远沉浸在自己的想法里。","又或者像星姐说的，其实大部分人不是不喜欢自己的本职工作，而是逃避压力和束缚，总觉得生活在别处。但其实任何事情，包括爱好，只要变成工作，都有压力和束缚，没有舒舒服服赚大钱的事儿。","如果你一直告诉自己我不喜欢这份工作，又无力挣脱，想法太多，实践太少，那样的话，你会一直陷入到一个死循环，一直颓废下去。","在上一期节目里，我们讲了一个爱情故事，但导致爱情失败的原因正是因为工作的失利。如果你像上一期的男主一样，因为一点挫折，就开始一蹶不振，不管是多么死心塌地爱着你的人也是会倦的。在这个飞速发展的社会里，没有人要为谁守身一辈子。我们需要正能量，需要一个可以和我们一起携手走向更好生活的人。无论你现在身处什么地方，只要你愿意继续努力，没有任何人嘲笑你的努力。所有吃过的苦，受过的嘲笑，最终都会以一记狠狠的耳光抽到他们的脸上。","不管是自己喜欢的工作，还是想要逃避。这终究都不是解决问题的根本办法。我们总说，我不喜欢这份工作，可是你都干了这么久了，对待工作就像感情一样，两个人相处还会日久生情，对待工作你就怎么一点都不能担待呢。或许有人会说，这份工作对我已经没有挑战性了，那你就去往上走啊，天外有天，人外有人这句话，不是空想，而是真的存在。每一个行业都有等级之分，等你在你的行业做到最顶级再来告诉我，没有挑战性。这个时候，你换工作，换职业，我会两个大拇指送给你。在这之前，我想请你好好想想，你到底是因为什么原因而不喜欢这份工作。","歌曲：曲婉婷\u2014\u2014阳光下的我们","【暖地电台】嗨，你在寻找什么","邻居的耳朵有声电台征稿ing，投稿者请将音频发送至linjudeerduo@126.com 详情请见","邻居的耳朵有声电台征稿要求","本文章版权属于文章作者所有，转载请与作者联系并注明出处：","【暖地电台】嗨，你在寻找什么"]
     * html :
     *
     *曲目：【暖地电台】嗨，你在寻找什么
     *
     *发行：邻居的耳朵有声电台
     *
     *最近有人在后台问我关于工作和生活的苦恼，生活中也有朋友在面临这样的苦恼，再加上最近看星姐的文章也受到一些感触，所以就写下这篇文章，说一下自己的感悟。我不能说我说的就是正确的，毕竟每个人都有每个人的想法。但是我希望，它能给正处在迷茫或者谷底的你们一些不同的看待问题的视角。如果你觉得你现在站在谷底，如果你现在正在迷茫，那么把心沉淀下来，好好想想你以后的路，勇敢的走出去，那么，你以后有的每一步，都是在走上坡路，都是在迈向成功。
     *
     *这几年网红正盛，各种励志、鸡汤，所有的书都告诉你不畏将来，想做什么就去做吧，不要让未来为你的懦弱买单。是的，这些励志的人，新一代的网红，他们是很努力，可是每一个人都有每一个人的生活方式，别人的不一定是适合你的。他们可以为自己的梦想买单，去做一般人不敢去做的事情，但那些人毕竟是少数人，在这个社会里，能做自己喜欢的工作的人不是特别多。但是他们为什么还会在这个行业做下去，一来是因为他的专业太局限，除了这份职业，他不会再做什么，也就是我们所谓的专业技术人员。试想一下，你让一个搞IT 的人去做一份营销报告，你让他怎么做。二来是因为他们需要这份工作带给他的一些其它利益。虽然不喜欢，但是稳定，安逸，可以有很多的时间去支配到其它的地方。三来我想应该也是最重要的一点，在这个世界里，行业千千万，有些事总是要有人去做的。
     *
     *这样的人真的很多，你要说世界那么大，他们不想去看看嘛。我想，那真的是扯淡。没有人不想不劳而获，但是没有人能不劳而获。所以看看眼前，问问自己，你到底想要什么。人生在世，不是每一件事情都称心如意的。那些追求梦想的人，没有一个人不是碰的头破血流之后才有的成就。周末的时候，我在家看跨界歌王，王子文作为替补歌手，当她唱完的时候，评委问她，听说当时还去韩国当过练习生。她说是的，那段日子真的是特别刻骨铭心。每天6点起床，晚上12点1点才能休息。不停的在训练，每天还吃不饱。试想一下，这样的苦你吃的了嘛。天上真的不会掉馅饼，如果你没有非人的勇气和坚持，那么就在自己的岗位上继续做下去吧。努力把不喜欢的工作变成喜欢的工作才是正道。
     *
     *在我刚进公司的时候，当时开动员大会，一个领导讲了这么一句话。她说：干一行爱一行，如果你现在不喜欢它，那么就想办法去爱上它。那样你会在其中找到更大的乐趣。她说完这句话到现在已经六年了，而我现在还记得。甚至还会记得很久。如今的我还是不怎么喜欢这份工作，但是我很清楚我不能改变它，那么我就去适应它，多想想这份工作给你带来的益处，而不是永远沉浸在自己的想法里。
     *
     *又或者像星姐说的，其实大部分人不是不喜欢自己的本职工作，而是逃避压力和束缚，总觉得生活在别处。但其实任何事情，包括爱好，只要变成工作，都有压力和束缚，没有舒舒服服赚大钱的事儿。
     *
     *如果你一直告诉自己我不喜欢这份工作，又无力挣脱，想法太多，实践太少，那样的话，你会一直陷入到一个死循环，一直颓废下去。
     *
     *在上一期节目里，我们讲了一个爱情故事，但导致爱情失败的原因正是因为工作的失利。如果你像上一期的男主一样，因为一点挫折，就开始一蹶不振，不管是多么死心塌地爱着你的人也是会倦的。在这个飞速发展的社会里，没有人要为谁守身一辈子。我们需要正能量，需要一个可以和我们一起携手走向更好生活的人。无论你现在身处什么地方，只要你愿意继续努力，没有任何人嘲笑你的努力。所有吃过的苦，受过的嘲笑，最终都会以一记狠狠的耳光抽到他们的脸上。
     *
     *不管是自己喜欢的工作，还是想要逃避。这终究都不是解决问题的根本办法。我们总说，我不喜欢这份工作，可是你都干了这么久了，对待工作就像感情一样，两个人相处还会日久生情，对待工作你就怎么一点都不能担待呢。或许有人会说，这份工作对我已经没有挑战性了，那你就去往上走啊，天外有天，人外有人这句话，不是空想，而是真的存在。每一个行业都有等级之分，等你在你的行业做到最顶级再来告诉我，没有挑战性。这个时候，你换工作，换职业，我会两个大拇指送给你。在这之前，我想请你好好想想，你到底是因为什么原因而不喜欢这份工作。
     *
     *歌曲：曲婉婷——阳光下的我们
     *
     *【暖地电台】嗨，你在寻找什么
     *
     *邻居的耳朵有声电台征稿ing，投稿者请将音频发送至linjudeerduo@126.com 详情请见
     *
     *邻居的耳朵有声电台征稿要求
     *
     *本文章版权属于文章作者所有，转载请与作者联系并注明出处：
     *
     *【暖地电台】嗨，你在寻找什么
     */
    @SerializedName("showapi_res_body")
    @Expose
    var showapi_res_body: ShowapiResBodyEntity? = null

    class ShowapiResBodyEntity {
        /**
         * height : 298
         * width : 300
         * url : http://ear.duomi.com/wp-content/uploads/2016/08/129060475+-300x298.jpg
         */
        //        @SerializedName("img_list")
        //        @Expose
        //        private List<ImgListEntity> img_list;
        /**
         * height : 298
         * width : 300
         * url : http://ear.duomi.com/wp-content/uploads/2016/08/129060475+-300x298.jpg
         */
        //        @SerializedName("all_list")
        //        @Expose
        //        private List<AllListEntity> all_list;

        @SerializedName("content")
        @Expose
        var content: String? = null
        @SerializedName("time")
        @Expose
        var time: String? = null
        @SerializedName("title")
        @Expose
        var title: String? = null
        @SerializedName("ret_code")
        @Expose
        var ret_code: Int = 0
        @SerializedName("html")
        @Expose
        var html: String? = null

        //        public List<ImgListEntity> getImg_list() {
        //            return img_list;
        //        }
        //
        //        public void setImg_list(List<ImgListEntity> img_list) {
        //            this.img_list = img_list;
        //        }
        //
        //        public List<AllListEntity> getAll_list() {
        //            return all_list;
        //        }
        //
        //        public void setAll_list(List<AllListEntity> all_list) {
        //            this.all_list = all_list;
        //        }

        class ImgListEntity {
            @SerializedName("height")
            @Expose
            var height: Int = 0
            @SerializedName("width")
            @Expose
            var width: Int = 0
            @SerializedName("url")
            @Expose
            var url: String? = null
        }

        class AllListEntity {
            @SerializedName("height")
            @Expose
            var height: Int = 0
            @SerializedName("width")
            @Expose
            var width: Int = 0
            @SerializedName("url")
            @Expose
            var url: String? = null
        }
    }
}
